containers/fio/sample-output/sample-32k.out
randwritejob-32k: (g=0): rw=randwrite, bs=32K-32K/32K-32K/32K-32K, ioengine=libaio, iodepth=8
fio-2.2.8
Starting 1 process
randwritejob-32k: Laying out IO file(s) (1 file(s) / 100MB)
Jobs: 1 (f=1): [w(1)] [100.0% done] [0KB/336.8MB/0KB /s] [0/10.8K/0 iops] [eta 00m:00s]
randwritejob-32k: (groupid=0, jobs=1): err= 0: pid=131: Thu Oct 26 22:53:40 2017
  write: io=1466.6MB, bw=300279KB/s, iops=9383, runt=  5001msec
    slat (usec): min=7, max=637, avg=20.19, stdev=12.45
    clat (usec): min=75, max=177498, avg=829.06, stdev=2326.56
     lat (usec): min=95, max=177520, avg=849.58, stdev=2327.04
    clat percentiles (usec):
     |  1.00th=[  516],  5.00th=[  564], 10.00th=[  596], 20.00th=[  628],
     | 30.00th=[  660], 40.00th=[  692], 50.00th=[  724], 60.00th=[  772],
     | 70.00th=[  844], 80.00th=[  948], 90.00th=[ 1080], 95.00th=[ 1192],
     | 99.00th=[ 1576], 99.50th=[ 2064], 99.90th=[ 2992], 99.95th=[10176],
     | 99.99th=[177152]
    bw (KB  /s): min=175360, max=204416, per=63.24%, avg=189888.00, stdev=20545.69
    lat (usec) : 100=0.01%, 250=0.05%, 500=0.59%, 750=55.16%, 1000=28.66%
    lat (msec) : 2=14.98%, 4=0.48%, 10=0.02%, 20=0.03%, 250=0.02%
  cpu          : usr=7.60%, sys=26.20%, ctx=44088, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=46928/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: io=1466.6MB, aggrb=300279KB/s, minb=300279KB/s, maxb=300279KB/s, mint=5001msec, maxt=5001msec

Disk stats (read/write):
  vda: ios=0/45808, merge=0/17, ticks=0/37550, in_queue=37520, util=97.78%